import { sample } from 'lodash';
import { faker } from '@faker-js/faker';

// ----------------------------------------------------------------------

const PRODUCT_NAME = [
  'سورة الفاتحة: 1-7 - بسم الله الرحمن الرحيم، الحمد لله رب العالمين، الرحمن الرحيم، مالك يوم الدين، إياك نعبد وإياك نستعين، اهدنا الصراط المستقيم، صراط الذين أنعمت عليهم غير المغضوب عليهم ولا الضالين.',
  'سورة البقرة: 286 - لا يكلف الله نفسا إلا وسعها.',
  'سورة آل عمران: 200 - يا أيها الذين آمنوا اصبروا وصابروا ورابطوا واتقوا الله لعلكم تفلحون.',
  'سورة الأنعام: 82 - أولئك الذين يؤمنون بآياتنا هم المؤمنون حقا.',
  'سورة الكهف: 110 - قل إنما أنا بشر مثلكم يوحى إليّ أنما إلهكم إله واحد.',
  'سورة الإسراء: 23 - وقضى ربك ألا تعبدوا إلا إياه وبالوالدين إحسانا.',
  'سورة الأنبياء: 87 - ولقد نادانا نوح فلنعم المجيبون.',
  'سورة الحشر: 18 - يا أيها الذين آمنوا اتقوا الله والتنظر نفس ما قدمت لغد.',
  'سورة النور: 35 - الله نور السماوات والأرض مثل نوره كمشكاة فيها مصباح.',
  'سورة النحل: 97 - من عمل صالحا من ذكر أو أنثى وهو مؤمن فلنحيينه حياة طيبة.',
  'سورة المرسلات: 15 - ويوم القيامة تردون إلى الله.',
  'سورة الصافات: 96 - الذي خلقني فهو يهدين.',
  'سورة الطلاق: 2 - ومن يتق الله يجعل له مخرجا.',
  'سورة التوبة: 51 - قل لن يصيبنا إلا ما كتب الله لنا هو مولانا وعلى الله فليتوكل المؤمنون.',
  'سورة الإخلاص: 1-4 - قل هو الله أحد، الله الصمد، لم يلد ولم يولد، ولم يكن له كفوا أحد.',
  'سورة الجاثية: 30 - فأما الذين آمنوا فيدخلهم ربهم في رحمته.',
  'سورة يوسف: 64 - إن الله مع الصابرين.',
  'سورة الكافرون: 6 - لكم دينكم ولي دين.',
  'سورة الشرح: 5-6 - فإن مع العسر يسرا، إن مع العسر يسرا.',
  'سورة الحجر: 98 - فسبح بحمد ربك وكن من الساجدين.'
];

const PRODUCT_COLOR = [
  '#00AB55',
  '#000000',
  '#FFFFFF',
  '#FFC0CB',
  '#FF4842',
  '#1890FF',
  '#94D82D',
  '#FFC107',
];

// ----------------------------------------------------------------------

export const products = [...Array(24)].map((_, index) => {
  const setIndex = index + 1;

  return {
    id: faker.string.uuid(),
    cover: `/assets/images/products/product_${setIndex}.jpg`,
    name: PRODUCT_NAME[index],
    price: '',
    priceSale: setIndex % 3 ? null : faker.number.int({ min: 19, max: 29, precision: 0.01 }),
    colors:
      (setIndex === 1 && PRODUCT_COLOR.slice(0, 2)) ||
      (setIndex === 2 && PRODUCT_COLOR.slice(1, 3)) ||
      (setIndex === 3 && PRODUCT_COLOR.slice(2, 4)) ||
      (setIndex === 4 && PRODUCT_COLOR.slice(3, 6)) ||
      (setIndex === 23 && PRODUCT_COLOR.slice(4, 6)) ||
      (setIndex === 24 && PRODUCT_COLOR.slice(5, 6)) ||
      PRODUCT_COLOR,
    status: sample(['new', 'new', '', '']),
  };
});
